# Dotfiles — Homebrew dependencies
# Install: brew bundle --file=./Brewfile

# Terminal
brew "tmux"

# Shell
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Modern CLI replacements
brew "bat"          # cat with syntax highlighting
brew "eza"          # ls with icons and colors
brew "git-delta"    # beautiful git diffs
brew "fzf"          # fuzzy finder (Ctrl+R, Ctrl+T)
brew "zoxide"       # smart cd that learns your directories
brew "glow"         # markdown viewer
brew "nano"         # modern nano with syntax highlighting
brew "ripgrep"      # faster grep (Claude's Grep tool uses this)
brew "fd"           # faster find
brew "jq"           # JSON processor
brew "yq"           # YAML processor (go version — NOT the python one)
brew "direnv"       # per-directory environment variables

# Python
brew "uv"           # modern Python package manager (replaces pip/poetry)

# Shell scripting quality
brew "shellcheck"   # bash linter
brew "shfmt"        # bash formatter

# Shell history sync
brew "atuin"        # encrypted shell history sync (requires separate `atuin login` — see runbook)

# Password / SSH key management
brew "bitwarden-cli"  # complements the Bitwarden desktop app

# Git
brew "gh"           # GitHub CLI

# Remote access
brew "mosh"         # mobile shell (SSH replacement with roaming)

# Fonts
cask "font-jetbrains-mono-nerd-font"

# ── GUI apps (macOS only) ────────────────────────────────────────
# Productivity
cask "alfred"              # Spotlight replacement (Powerpack license entered manually)
cask "hiddenbar"           # Menu bar item hider
cask "latest"              # App update checker

# Input & window management
cask "linearmouse"         # Mouse acceleration + scroll tuning
cask "dockdoor"            # Windows-style dock preview + alt-tab
cask "logi-options+"       # Logitech device sync

# Screenshots, notes, keys
cask "ishare"              # Screenshot replacement for ⌘⇧3/4
cask "xykong/tap/flux-markdown"  # Markdown QuickLook preview (3rd-party tap)
cask "dockey"              # SSH key manager

# Window management
cask "rectangle"    # keyboard + drag tiling (⌃⌥ arrows, drag-to-edge snap)

# System monitoring
cask "stats"        # menu bar CPU/memory/network/temp (useful for headless mini)

# Security & passwords
cask "bitwarden"           # password manager

# Network
cask "tailscale-app"       # VPN to personal tailnet

# Communication
cask "google-chrome"
cask "discord"
cask "whatsapp"
cask "telegram"

# Display — critical for headless Mac mini remote desktop crispness
cask "betterdisplay"       # virtual display for matching client resolution

# Container runtime (faster + lighter than Docker Desktop)
cask "orbstack"     # Docker Engine + Linux VMs, native Apple Virtualization

